"InvoiceMaster Pro" = "InvoiceMaster Pro";
"Dashboard" = "Tableau de bord";
"Clients" = "Clients";
"Items" = "Articles";
"Estimates" = "Devis";
"Invoices" = "Factures";
"Templates" = "Modèles";
"Upload Logo" = "Importer le logo";
"Remove Logo" = "Supprimer le logo";
"Preview" = "Aperçu";
"Save" = "Enregistrer";
"Settings" = "Réglages";
"New Client" = "Nouveau client";
"New Item" = "Nouvel article";
"New" = "Nouveau";
"Number" = "Numéro";
"Issue Date" = "Date d’émission";
"Currency" = "Devise";
"Notes" = "Notes";
"Please restart the app to apply language." = "Veuillez redémarrer l’app pour appliquer la langue.";
"Quit Now" = "Quitter maintenant";
"Later" = "Plus tard";
"General" = "Général";
"Documents" = "Documents";
"Sign Out" = "Se déconnecter";
"Welcome to InvoiceMaster Pro" = "Bienvenue dans InvoiceMaster Pro";
"Search" = "Rechercher";
"Status" = "Statut";
"All" = "Tous";
"Draft" = "Brouillon";
"Sent" = "Envoyé";
"Paid" = "Payé";
"Language" = "Langue";
"App Language" = "Langue de l’app";
"Backup" = "Sauvegarde";
"Export Backup" = "Exporter la sauvegarde";
"Import Backup" = "Importer la sauvegarde";
"Delete" = "Supprimer";
"Appearance" = "Apparence";
"Theme" = "Thème";
"System" = "Système";
"Light" = "Clair";
"Dark" = "Sombre";
"Currency" = "Devise";
"OpenExchangeRates API Key" = "Clé API OpenExchangeRates";
"Type to search across clients, invoices, estimates and items." = "Tapez pour chercher parmi clients, factures, devis et articles.";
"Close" = "Fermer";
"Delete this client?" = "Supprimer ce client ?";
"This will also remove its association from documents." = "Cela supprimera aussi son association des documents.";
"Delete this item?" = "Supprimer cet article ?";
"This will not delete line items already using it." = "Cela ne supprimera pas les lignes qui l'utilisent déjà.";
"Cancel" = "Annuler";
"Invoice" = "Facture";
"Estimate" = "Devis";
"Description" = "Description";
"Qty" = "Qté";
"Tax %" = "TVA %";
"Line Items" = "Lignes";
"Add" = "Ajouter";
"Blank Line" = "Ligne vide";
"Subtotal" = "Sous‑total";
"Tax" = "Taxe";
"Total" = "Total";
"Name" = "Nom";
"Email" = "E-mail";
"Phone" = "Téléphone";
"Address" = "Adresse";
"City" = "Ville";
"Country" = "Pays";
"Tax ID" = "NIF";
"Notes" = "Notes";
"Unit" = "Unité";
"Unit Price" = "Prix unitaire";
"Tax Rate %" = "TVA %";
"Bill From" = "Émetteur";
"Bill To" = "Destinataire";
"Revenue" = "Revenus";
"Unpaid" = "Impayées";
"Overdue" = "En retard";
"Cash Flow" = "Trésorerie";
"Top Products" = "Produits principaux";
"List" = "Liste";
"Board" = "Tableau";
"Calendar" = "Calendrier";
"Duplicate" = "Dupliquer";
"Please fix the following issues:" = "Veuillez corriger les points suivants :";
"Number is required" = "Le numéro est obligatoire";
"Currency is required" = "La devise est obligatoire";
"Description is required" = "La description est obligatoire";
"Select" = "Sélectionner";
"Selected" = "sélectionnés";
"Set Status" = "Définir le statut";
"Delete Selected" = "Supprimer la sélection";
"Are you sure you want to delete the selected documents?" = "Voulez-vous vraiment supprimer les documents sélectionnés ?";
"Reports" = "Rapports";
"Revenue by Month" = "Revenus par mois";
"Unpaid Summary" = "Résumé des impayées";
"From" = "De";
"To" = "À";
"Currency Filter" = "Filtre devise";
"All Currencies" = "Toutes les devises";
"Export CSV" = "Exporter CSV";
"Top Clients" = "Meilleurs clients";
"Unknown Client" = "Client inconnu";
"Unknown Item" = "Article inconnu";
"Notifications" = "Notifications";
"Enable Notifications" = "Activer les notifications";
"Days before due" = "Jours avant échéance";
"Send Test Notification" = "Envoyer une notification de test";
"Invoice Due Soon" = "Facture bientôt échue";
"Invoice %@ is due on %@." = "La facture %@ est échue le %@.";
"Test Notification" = "Notification de test";
"This is a test notification from InvoiceMaster Pro." = "Ceci est une notification de test d’InvoiceMaster Pro.";
"Preferences" = "Préférences";
"Language Change" = "Changement de langue";
"The application needs to restart for the language change to take effect." = "L'application doit redémarrer pour appliquer le changement de langue.";
"Restart Now" = "Redémarrer maintenant";
"Later" = "Plus tard";

/* BTP Construction Specific Translations */

/* Construction Types */
"construction.new" = "Construction neuve";
"construction.renovation" = "Rénovation";
"construction.extension" = "Extension";
"construction.amenagement" = "Aménagement";
"construction.maintenance" = "Entretien";
"construction.repair" = "Réparation";

/* Work Zones */
"zone.interior" = "Intérieur";
"zone.exterior" = "Extérieur";
"zone.both" = "Int. & Ext.";
"zone.infrastructure" = "Infrastructure";
"zone.roof" = "Toiture";
"zone.facade" = "Façade";

/* Corps d'état - Construction Trades */
"corps.gros_oeuvre" = "Gros œuvre";
"corps.terrassement" = "Terrassement";
"corps.fondations" = "Fondations";
"corps.maconnerie" = "Maçonnerie";
"corps.beton_arme" = "Béton armé";
"corps.charpente" = "Charpente";
"corps.couverture" = "Couverture";
"corps.etancheite" = "Étanchéité";
"corps.isolation" = "Isolation";
"corps.cloisons" = "Cloisons";
"corps.platerie" = "Plâtrerie";
"corps.menuiserie_ext" = "Menuiserie extérieure";
"corps.menuiserie_int" = "Menuiserie intérieure";
"corps.fermetures" = "Fermetures";
"corps.verrerie" = "Verrerie";
"corps.plomberie" = "Plomberie";
"corps.electricite" = "Électricité";
"corps.chauffage" = "Chauffage";
"corps.climatisation" = "Climatisation";
"corps.ventilation" = "Ventilation";
"corps.ascenseurs" = "Ascenseurs";
"corps.carrelage" = "Carrelage";
"corps.sols" = "Sols souples";
"corps.peinture" = "Peinture";
"corps.papier_peint" = "Papier peint";
"corps.faience" = "Faïence";
"corps.facade" = "Façade";
"corps.bardage" = "Bardage";
"corps.vrd" = "VRD";
"corps.espaces_verts" = "Espaces verts";
"corps.clotures" = "Clôtures";
"corps.cuisines" = "Cuisines";
"corps.salles_bains" = "Salles de bains";
"corps.domotique" = "Domotique";
"corps.securite" = "Sécurité";
"corps.nettoyage" = "Nettoyage";

/* Units */
"unit.m2" = "m²";
"unit.cm2" = "cm²";
"unit.hectare" = "ha";
"unit.m3" = "m³";
"unit.litre" = "L";
"unit.dm3" = "dm³";
"unit.m" = "m";
"unit.cm" = "cm";
"unit.mm" = "mm";
"unit.km" = "km";
"unit.ml" = "ml";
"unit.kg" = "kg";
"unit.tonne" = "T";
"unit.gramme" = "g";
"unit.unite" = "u";
"unit.piece" = "pce";
"unit.lot" = "lot";
"unit.ensemble" = "ens";
"unit.forfait" = "forfait";
"unit.global" = "global";
"unit.heure" = "h";
"unit.jour" = "j";
"unit.semaine" = "sem";
"unit.mois" = "mois";
"unit.point" = "pt";
"unit.ouvrant" = "ouvr";
"unit.poste" = "poste";
"unit.circuit" = "circuit";
"unit.paire" = "paire";

/* Document Types */
"document.invoice" = "Facture";
"document.quote" = "Devis";
"document.project" = "Projet";
"document.work_order" = "Bon de commande";

/* Status */
"status.draft" = "Brouillon";
"status.sent" = "Envoyé";
"status.accepted" = "Accepté";
"status.rejected" = "Refusé";
"status.in_progress" = "En cours";
"status.completed" = "Terminé";
"status.paid" = "Payé";
"status.overdue" = "En retard";
"status.cancelled" = "Annulé";

/* Legal Terms */
"legal.vat_number" = "N° TVA";
"legal.company_registration" = "SIRET";
"legal.insurance_number" = "N° Assurance";
"legal.payment_terms" = "Conditions de paiement";
"legal.warranty" = "Garantie";
"legal.liability" = "Responsabilité";
"legal.payment_due" = "Échéance de paiement";
"legal.late_payment_interest" = "Intérêts de retard";

/* Project Information */
"project.name" = "Nom du projet";
"project.address" = "Adresse du chantier";
"project.start_date" = "Date de début";
"project.end_date" = "Date de fin";
"project.phase" = "Phase";
"project.coordinator" = "Coordinateur";
"project.permit_number" = "N° de permis";

/* Financial */
"financial.subtotal" = "Sous-total";
"financial.vat" = "TVA";
"financial.total" = "Total";
"financial.discount" = "Remise";
"financial.advance" = "Acompte";
"financial.retention" = "Retenue de garantie";
"financial.margin" = "Marge";
"financial.cost_price" = "Prix de revient";
"financial.selling_price" = "Prix de vente";

/* Certifications */
"certification.rge" = "RGE";
"certification.qualibat" = "Qualibat";
"certification.qualit_enr" = "Qualit'EnR";
"certification.pro_ite" = "Pro-ITE";
"certification.eco_artisan" = "Éco-Artisan";
"certification.certibat" = "Certibat";
"certification.cekal" = "Cekal";
"certification.cerga" = "CERGA";
"certification.wtcb" = "WTCB";
"certification.belgium_green_building" = "Belgium Green Building Council";
"certification.atg" = "ATG";
"certification.ce_marking" = "Marquage CE";
"certification.iso_9001" = "ISO 9001";
"certification.iso_14001" = "ISO 14001";
"certification.ohsas_18001" = "OHSAS 18001";

/* Client Types */
"client.individual" = "Particulier";
"client.company" = "Entreprise";

/* Export */
"export.documents" = "Documents";
"export.clients" = "Clients";
"export.items" = "Articles";
"export.accounting" = "Écritures comptables";
"export.error.invalid_date_range" = "Plage de dates invalide";
"export.error.currency_required" = "Devise requise";


